package project0214;

public class class002 {

	public static void main(String[] args) {
		/*
		 * ******이것은 바로 중복된 코드를 처리하기 위한 것(중복된 코드를 계속 그대로 쓰고나서 고치려면 찾아다냐야 되자나) _그렇다면 고칠 일이 없다면?! 그냥 두번 쓰는 게 더 빠르고 편하긴 함!
		 반복문 - 연속되는 반복코드
		 		for ( ①표현식 ; ②boolean이 리턴되는 표현식 ; ③표현식){
		 			반복할 내용
		 		}

		 			- For문에서 1표현식 확인, 2 확인 false가 아니면 중괄호 내용 실행, 닫는괄호에서 3식으로 갔다가, 2식. false이면 다시 중괄호, false가 아니면 닫는괄호 다음으로.
		 				각 식은 생략 가능. 첫번째와 세번째는 , 로 두 식 이상 쓸 수 있음(하지만 지저분해서 잘 안 함)
		 				
		 		 while (boolean이 나오는 표현식){
		 		 	반복할 내용
		 		 }
		 		 		=> 얘는 boolean이 나오는 표현식이 false가 될 때까지 괄호 안의 내용을 반복 수행
		 		 do~while
		 		 	do{
		 		 		반복할 내용
		 		 	while(boolean이 나오는 표현식);
		 		 		=> 얘는 boolean이 나오는 표현식이 false가 될 때까지 괄호 안의 내용을 반복 수행
		 		 		=> 표현식이 뒤에 나오기 때문에 괄호 안의 내용은 반드시 한 번 수행. 내용 하고, boolean 점검해서 돌아갈 지 말지 결정
		 		 		=> while 뒤에 ;에 주의해야 합니다.(여태 중괄호 앞에 안써서 방심하지 말기)
		 메소드 - 연속되지 않는 반복되는 코드
		 
		 클래스 - 메소드가 여러개있던데? 그럼 메소드는 묶인채 클래스가 되었네
		 
		 상속
		 */
		/*
		 for(int i=0; i<2; i=i+1){
		 System.out.printf("Hello Java"); 
		 */
		
	}

}
