package project0214;

public class practice006 {
	
	/*
	 1. 하나의 정수를 입력받아서 정수의 값이 10보다 크면 충분하다라고 메시지를 출력하고
	 	5~9 사이라면 주의하라고 출력하고 0보다 작거나 같다면 주문을 하라고 출력
	*/
	
	
	/*
	 2. Hello TJOEUN을 5번 출력
	*/
	
	/*
	 3.
	 	*****
	 	*****
	 	*****
	 	*****
	 	*****
	*/
	
	/*
	 4.
	 	***
	 	**
	 	*
	 	**
	 	***
	*/
	
	/*
	 5. 11번째 피보나치 수열의 값을 찾아보기
	 	피보나치 수열 : 1,1,2,3,5,8,13,21,34..........
	 	첫번째와 두번째는 무조건 1, 세번째부터는 이전 2개항의 합
	 */
	
	/*
	 6.
	 		   1
	 		  2 3
	 		 4   5
	 		6789012
	 */
	
}
